Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F44B.tmx
Source language: en_us
Languages: zh_cn

source: Zodiac sign Capricorn Love Compatibility
zh_cn: 摩羯座与12星座的爱情解析

source: Capricorn and Aries love compatibility
zh_cn: 1.摩羯座与白羊座的爱情

source: Not a hopeful combination.
zh_cn: 这一对儿的爱情前景并不乐观。

source: Saturn, represented by Father Time, is the Capricorn's standard bearer.
zh_cn: 时间老人所代表的土星是摩羯座的守护神。

source: The Aries is a restless,fiery, impulsive experimenter. The Capricorn is on the contrary sanctimonious person.
zh_cn: 白羊座是热情冲动的实验家，相反，摩羯座表面上总是一本正经的。

source: Capricorn needs to dominate and so does Aries.
zh_cn: 这俩个星座都有支配他人的欲望。

source: Problems also crop up over money Aries is extravagant, Capricorn is security minded.
zh_cn: 他们在有关金钱的问题上也经常产生矛盾：白羊座喜铺张挥霍，而摩羯座更多的是考虑财产安全稳定性。

source: Capricorn is a simple soul and Aries may be too overwhelming; Aries will take risks and enjoy them while the same risks will make Capricorn shudder.
zh_cn: 白羊座思想单纯，而摩羯座可能有些强势；白羊座勇于冒险而摩羯座遇到风险就不寒而栗。

source: Some very violent quarrels can erupt due to this and the many other personality conflicts.
zh_cn: 基于这些因素及性格不和，这一对组合之间经常会发生激烈的争吵。

source: Aries will not like the pessimistic gloom that Capricorn use to dampen the Aries enthusiasms.
zh_cn: 摩羯座忧郁悲观的情绪会浇灭白羊座的热情之火，这使白羊座非常不快。

source: If it takes place, a marriage is more preferable then a short connection.
zh_cn: 这种情况下，结婚要优于短期的交往。

source: Capricorn and Taurus love compatibility
zh_cn: 2.摩羯座与金牛座的爱情

source: Both partners having mutual understanding of each other's personalities.
zh_cn: 双方均了解彼此的个性。

source: Both the Capricorn and the Taurus like money, and sure that the safety is really important.
zh_cn: 摩羯和金牛都喜欢金钱，当然对他们来说财产安全非常重要。

source: While the Taurus is a patient person the Capricorn is ready to work for both of them.
zh_cn: 金牛座是有耐心的人，摩羯座愿意为自己和对方努力打拼。

source: Taurus can get through to aloof, cautious Capricorn and give the encouragement and responsiveness needed.
zh_cn: 金牛能理解摩羯的冷漠和谨小慎微，也能在需要时给予对方鼓励和支持。

source: Both have earthy, passionate natures, and sensual Taurus can tap the deep well of romanticism that lies under Capricorn's reserve.
zh_cn: 双方都很朴实而又充满激情，细致的金牛能挖掘出摩羯心底深藏的那份浪漫情怀。

source: There are perfect prospects for that couple and it can turn out to be a very compatible marriage.
zh_cn: 这一组合前景美好，他们的婚姻可能会非常和谐。

source: Capricorn and Gemini love compatibility
zh_cn: 3.摩羯座与双子座的爱情

source: They have different sexual natures.
zh_cn: 这两个星座的本性不同。

source: The Saturn ruled Capricorn will be at odds with the Mercury ruled Gemini.
zh_cn: 土星守护下的摩羯座与水星守护下的双子座之间没有多少共同点。

source: The Gemini are usually easy-going, amorous people, while the Capricorn are sluggish, devoted, cautious.
zh_cn: 双子通常为人随和而多情，摩羯则比较沉闷谨慎。

source: Capricorn will have a hard time holding the reins on excitable, flirtatious, wayward Gemini.
zh_cn: 摩羯要非常耐心的应对对面这个反复无常、放纵而浮躁的人。

source: The initial interest can not last very long.
zh_cn: 双方一开始对彼此的兴趣可能不会维持太长时间。

source: Capricorn and Cancer love compatibility
zh_cn: 4.摩羯座与巨蟹座的爱情

source: The Capricorn is not able to pay very much attention to the partner, and it doesn't meet the Cancer's wishes.
zh_cn: 摩羯不能给予对方足够的关注，因而巨蟹的期望没有得到满足。

source: The Capricorn has too much other interests.
zh_cn: 摩羯的许多兴趣在其他方面。

source: Both are good money managers and are unlikely to have many financial problems.
zh_cn: 这俩个星座都是理财能手，在经济上不会出现太多问题。

source: Waste is an offense to Capricorn as is extravagance.
zh_cn: 浪费与挥霍无度的行为是摩羯难以忍受的。

source: Capricorn is a faithful and devoted mate which the more positive type of Cancer can be content with, even if life does get a little boring at times.
zh_cn: 摩羯绝对是忠诚的伴侣，巨蟹中较积极的那种人对此很是知足，尽管他有时会觉得生活有些枯燥。

source: The connection is unstable, the marriage is undesirable.
zh_cn: 这一组的结合不是很稳定，他们的婚姻不是很理想。

source: Capricorn and Leo love compatibility
zh_cn: 5.摩羯座与狮子座的爱情

source: Ordered, organized Capricorn neither understands nor approves of Leo's exuberant impulsiveness.
zh_cn: 做事向来有条不紊的摩羯不会明白也不会赞同狮子过分冲动的行为。

source: Leo forgives and forgets; Capricorn being the one who is slow to anger and seldom forgets.
zh_cn: 狮子凡事能做到既往不咎，而摩羯虽然不容易发火，但很难做到尽释前嫌。

source: The Leo supposes that the Capricorn is full of love and spends it too economically.
zh_cn: 狮子认为摩羯是充满激情，虽然对方很少表现出来。

source: The Capricorn for his/her turn is also not the best partner for the Leo because of his/her poor imagination.
zh_cn: 摩羯和狮子不是最佳伴侣，因为前者缺乏想象力。

source: They are both representatives of independent signs of the zodiac that inclined to dominate in everyday life.
zh_cn: 他们都是那种渴望在日常生活中支配他人的独立星座。

source: Capricorn and Virgo love compatibility
zh_cn: 6.摩羯座与处女座的爱情

source: Virgo's neat orderly mind meshes well with Capricorn's self-discipline and capacity for hard work.
zh_cn: 处女座心思缜密，这正与摩羯座的自律和吃苦耐劳相得益彰。

source: Both take pride in their home, enjoy having a few close friends rather than many acquaintances, and admire each other's intellectual abilities.
zh_cn: 这两个人都对家庭引以为豪，相互欣赏对方的睿智，也都喜欢三五知己而不是泛泛之交。

source: The Caoricorn's practicality suits the Virgo's accuracy perfectly.
zh_cn: 摩羯注重实际，处女追求精确，二者在这方面很是般配。

source: They are both - clever, conservative and patient.
zh_cn: 这两个星座都是保守、聪明而又耐心的人。

source: This relationship could suffer from lack of romance, as both tend to be a bit reserved in this area.
zh_cn: 他们的关系中可能缺少浪漫的元素，因为双方在这方面都有点拘谨。

source: Generally there is a good basis for a long union.
zh_cn: 总的来说这对儿星座有长久发展的良好基础。

source: Capricorn and Libra love compatibility
zh_cn: 7.摩羯座与天秤座的爱情

source: Libra in her/his part likes the Capricorn's aspiration to earn money.
zh_cn: 摩羯向往赚大钱，天秤就喜欢这一点。

source: However, the Libra's propensity for laziness irritates the Capricorn who got used to work without a rest.
zh_cn: 但是天秤懒惰的习性会使习惯了持续工作的摩羯倍感不快。

source: As a result the Libra will be dissatisfied by a Capricorn's sober practicality.
zh_cn: 结果，天秤会越发不满于摩羯的严肃和现实态度。

source: The Capricorn wouldn't like Libra's constant attempts to be center of everyone's attention.
zh_cn: 摩羯不喜欢天秤总想成为众人焦点的那种心态。

source: Capricorn and Scorpio love compatibility
zh_cn: 8.摩羯座与天蝎座的爱情

source: Scorpio is the more imaginative lover, but Capricorn's stamina is a delightful match.
zh_cn: 天蝎座是充满想象力的伴侣，这与精力充沛的摩羯座正好相配。

source: Scorpio's possessiveness spells security to Capricorn.
zh_cn: 天蝎强烈的占有欲可以给摩羯带来安全感。

source: These two work well as a team - Capricorn is highly organized and Scorpio has native shrewdness.
zh_cn: 这俩个星座在工作上是很好的搭档--摩羯有条不紊，天蝎机智精明。

source: The Scorpio is more inventive, while the Capricorn is more patient.
zh_cn: 摩羯更有耐心，天蝎善于创造。

source: The representatives of both signs have strong will, but the Scorpio is inclined to dominate. The Capricorn must understand, that it happens because of the Scorpio's great love.
zh_cn: 他们都有坚强的意志，而天蝎的支配欲更强，摩羯也要了解这种支配欲正是出于天蝎对自己强烈的爱。
